jddaigle/uDelta/Software/arduino-1.0.6/hardware/teensy/boards.txt
teensylu.name=Teensylu
teensylu.upload.protocol=avr109
teensylu.upload.maximum_size=122880
teensylu.upload.speed=115200
teensylu.upload.disable_flushing=true
teensylu.serial.restart_cmd=true
teensylu.serial.safe_baud_rates_only=true
teensylu.upload.avrdude_wrapper=avrdude
teensylu.build.mcu=at90usb1286
teensylu.build.core=teensy
teensylu.build.dependency=true
teensylu.build.serial_number=true
teensylu.menu.usb.serial.name=Serial
teensylu.menu.usb.serial.build.define0=-DUSB_SERIAL
teensylu.menu.speed.16.name=16 MHz
teensylu.menu.speed.16.build.f_cpu=16000000L
teensylu.menu.keys.en-us.name=US English
teensylu.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensylu.menu.keys.fr-ca.name=Canadian French
teensylu.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensylu.menu.keys.da-da.name=Danish
teensylu.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensylu.menu.keys.fi-fi.name=Finnish
teensylu.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensylu.menu.keys.fr-fr.name=French
teensylu.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensylu.menu.keys.fr-be.name=French Belgian
teensylu.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensylu.menu.keys.fr-ch.name=French Swiss
teensylu.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensylu.menu.keys.de-de.name=German
teensylu.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensylu.menu.keys.de-ch.name=German Swiss
teensylu.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensylu.menu.keys.is-is.name=Icelandic
teensylu.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensylu.menu.keys.en-ie.name=Irish
teensylu.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensylu.menu.keys.it-it.name=Italian
teensylu.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensylu.menu.keys.no-no.name=Norwegian
teensylu.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensylu.menu.keys.pt-pt.name=Portuguese
teensylu.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensylu.menu.keys.pt-br.name=Portuguese Brazilian
teensylu.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensylu.menu.keys.es-es.name=Spanish
teensylu.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensylu.menu.keys.es-mx.name=Spanish Latin America
teensylu.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensylu.menu.keys.sv-se.name=Swedish
teensylu.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensylu.menu.keys.en-gb.name=United Kingdom
teensylu.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensylu.menu.keys.usint.name=US International
teensylu.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

cdcteensylu.name=[CDC]Teensylu
cdcteensylu.upload.protocol=avr109
cdcteensylu.upload.maximum_size=130048
cdcteensylu.build.mcu=at90usb1286
cdcteensylu.build.f_cpu=16000000L
cdcteensylu.build.core=teensy
cdcteensylu.build.define0=-DUSB_SERIAL
cdcteensylu.build.define1=-DLAYOUT_US_ENGLISH
cdcteensylu.upload.speed=115200
cdcteensylu.bootloader.file=BootloaderCDC.hex
cdcteensylu.bootloader.path=cdcteensylu
cdcteensylu.bootloader.low_fuses=0xde
cdcteensylu.bootloader.high_fuses=0xdb
cdcteensylu.bootloader.extended_fuses=0xf0